PJayChen/STM32f4xx_Bootloader/Utilities/stm32f4_evb_lcd.c
/**
  ******************************************************************************
  * @file    stm32f4_evb_lcd.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    18-March-2013
  * @brief   This file includes the LCD driver for Himax HX8352-T TFT Driver
			 of STM32F4-EVB evaluation board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "stm32f4_evb_lcd.h"
#include "stm32f4xx_fsmc.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup STM32_EVAL
  * @{
  */

/** @addtogroup STM32F4_EVB
  * @{
  */

/** @defgroup STM32F4_EVB_LCD
  * @{
  */

/** @defgroup STM32F4_EVB_LCD_Private_TypesDefinitions
  * @{
  */
typedef struct
{
	__IO uint16_t LCD_REG;
	__IO uint16_t LCD_RAM;
} LCD_TypeDef;
/**
  * @}
  */

/** @defgroup STM32F4_EVB_LCD_Private_Defines
  * @{
  */
/* Note: LCD /CS is NE3 - Bank 3 of NOR/SRAM Bank 1~4 */
#define Bank1_SRAM2_ADDR	0x64000000
#define LCD_BASE			0x68000000
#define LCD					((LCD_TypeDef *) LCD_BASE)
#define MAX_POLY_CORNERS	200
#define POLY_Y(Z)			((int32_t)((Points + Z)->X))
#define POLY_X(Z)			((int32_t)((Points + Z)->Y))
#define LCD_WriteRAM(var)	(LCD->LCD_RAM = var)
#define LCD_ReadRAM			(LCD->LCD_RAM)

/**
  * @}
  */

/** @defgroup STM32F4_EVB_LCD_Private_Macros
  * @{
  */
#define ABS(X) ((X) > 0 ? (X) : -(X))
/**
  * @}
  */

/** @defgroup STM32F4_EVB_LCD_Private_Variables
  * @{
  */
static sFONT *LCD_Currentfonts;

  /* Global variables to set the written text color */
static __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;

/**
  * @}
  */


/** @defgroup STM32F4_EVB_LCD_Private_FunctionPrototypes
  * @{
  */
#ifndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay*/
static void PutPixel(int16_t x, int16_t y);
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);
static uint16_t *vram_buffer;
/**
  * @}
  */


/** @defgroup STM32F4_EVB_LCD_Private_Functions
  * @{
  */
void DMA_Config(void)
{
	DMA_InitTypeDef  DMA_InitStructure;

	DMA_DeInit(DMA2_Stream1);
	while (DMA_GetCmdStatus(DMA2_Stream1) != DISABLE)
	{
	}
	DMA_DeInit(DMA2_Stream3);
	while (DMA_GetCmdStatus(DMA2_Stream3) != DISABLE)
	{
	}
	DMA_InitStructure.DMA_Channel				= DMA_Channel_0;
	DMA_InitStructure.DMA_PeripheralBaseAddr	= 0x64000000;
	DMA_InitStructure.DMA_Memory0BaseAddr		= 0x68000002;
	DMA_InitStructure.DMA_DIR					= DMA_DIR_MemoryToMemory;
	DMA_InitStructure.DMA_BufferSize			= 48000;
	DMA_InitStructure.DMA_PeripheralInc			= DMA_PeripheralInc_Enable;
	DMA_InitStructure.DMA_MemoryInc				= DMA_MemoryInc_Disable;
	DMA_InitStructure.DMA_PeripheralDataSize	= DMA_PeripheralDataSize_HalfWord;
	DMA_InitStructure.DMA_MemoryDataSize		= DMA_MemoryDataSize_HalfWord;
	DMA_InitStructure.DMA_Mode					= DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority				= DMA_Priority_Low;
	DMA_InitStructure.DMA_FIFOMode				= DMA_FIFOMode_Enable;         
	DMA_InitStructure.DMA_FIFOThreshold			= DMA_FIFOThreshold_Full;
	DMA_InitStructure.DMA_MemoryBurst			= DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst		= DMA_MemoryBurst_Single;
	DMA_Init(DMA2_Stream1, &DMA_InitStructure);
	DMA_InitStructure.DMA_Channel				= DMA_Channel_0;
	DMA_InitStructure.DMA_PeripheralBaseAddr	= 0x64000000 + 96000;
	DMA_InitStructure.DMA_Memory0BaseAddr		= 0x68000002;
	DMA_InitStructure.DMA_DIR					= DMA_DIR_MemoryToMemory;
	DMA_InitStructure.DMA_BufferSize			= 48000;
	DMA_InitStructure.DMA_PeripheralInc			= DMA_PeripheralInc_Enable;
	DMA_InitStructure.DMA_MemoryInc				= DMA_MemoryInc_Disable;
	DMA_InitStructure.DMA_PeripheralDataSize	= DMA_PeripheralDataSize_HalfWord;
	DMA_InitStructure.DMA_MemoryDataSize		= DMA_MemoryDataSize_HalfWord;
	DMA_InitStructure.DMA_Mode					= DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority				= DMA_Priority_Low;
	DMA_InitStructure.DMA_FIFOMode				= DMA_FIFOMode_Enable;         
	DMA_InitStructure.DMA_FIFOThreshold			= DMA_FIFOThreshold_Full;
	DMA_InitStructure.DMA_MemoryBurst			= DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst		= DMA_MemoryBurst_Single;
	DMA_Init(DMA2_Stream3, &DMA_InitStructure);

	return;
}

/**
  * @brief  DeInitializes the LCD.
  * @param  None
  * @retval None
  */
void LCD_DeInit(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/*!< LCD Display Off */
	LCD_DisplayOff();

	/* BANK 3 (of NOR/SRAM Bank 1~4) is disabled */
	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM3, ENABLE);

	/*!< LCD_SPI DeInit */
	FSMC_NORSRAMDeInit(FSMC_Bank1_NORSRAM3);

	/*-- GPIO Configuration ------------------------------------------------------*/
	/* SRAM Data lines configuration */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_9 |
								  GPIO_Pin_10 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOD, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource10, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_MCO);


	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 |
								  GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 |
								  GPIO_Pin_15;

	GPIO_Init(GPIOE, &GPIO_InitStructure);

