PJayChen/STM32f4xx_Bootloader/Utilities/stm32f4_evb_lcd.c
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource7, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource8, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource9, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource10, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource11, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource12, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource13, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource14, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource15, GPIO_AF_MCO);

	/* SRAM Address lines configuration */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 |
								  GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_12 | GPIO_Pin_13 |
								  GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_Init(GPIOF, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource0, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource1, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource2, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource3, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource4, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource5, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource12, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource13, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource14, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOF,GPIO_PinSource15, GPIO_AF_MCO);


	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 |
								  GPIO_Pin_4 | GPIO_Pin_5;

	GPIO_Init(GPIOG, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOG,GPIO_PinSource0, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOG,GPIO_PinSource1, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOG,GPIO_PinSource2, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOG,GPIO_PinSource3, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOG,GPIO_PinSource4, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOG,GPIO_PinSource5, GPIO_AF_MCO);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13;

	GPIO_Init(GPIOD, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOD,GPIO_PinSource11, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource12, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource13, GPIO_AF_MCO);

	/* NOE and NWE configuration */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 |GPIO_Pin_5;

	GPIO_Init(GPIOD, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource4, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource5, GPIO_AF_MCO);

	/* NE3 configuration */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;

	GPIO_Init(GPIOG, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOG, GPIO_PinSource12, GPIO_AF_MCO);

	/* NBL0, NBL1 configuration */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_Init(GPIOE, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOE,GPIO_PinSource0, GPIO_AF_MCO);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource1, GPIO_AF_MCO);
}

/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void LCD_Init(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
	vram_buffer = (uint16_t *)Bank1_SRAM2_ADDR;
	memset(vram_buffer, 0x00, 0x800000);
	/* Configure the LCD Control pins --------------------------------------------*/
	LCD_CtrlLinesConfig();
	/* Configure the FSMC Parallel interface -------------------------------------*/
	LCD_FSMCConfig();
	DMA_Config();
	_delay_(1); /* delay 10 ms */
	LCD->LCD_REG = 0x01; // soft reset
	LCD->LCD_REG = 0xD0;
	LCD->LCD_RAM = 0x07;
	LCD->LCD_RAM = 0x01;
	LCD->LCD_RAM = 0x08;
	LCD->LCD_REG = 0xD1;
	LCD->LCD_RAM = 0x00;
	LCD->LCD_RAM = 0x71;
	LCD->LCD_RAM = 0x19;
	LCD->LCD_REG = 0xD2; // power setting
	LCD->LCD_RAM = 0x01;
	LCD->LCD_RAM = 0x44;
	LCD->LCD_REG = 0x11; // Exit Sleep
	_delay_(10);
	LCD->LCD_REG = 0x36; // set address mode
	LCD->LCD_RAM = 0x28;
	LCD->LCD_REG = 0x3A; // set pixel format
	LCD->LCD_RAM = 0x55;
	LCD->LCD_REG = 0x2A; // set column address
	LCD->LCD_RAM = 0x00;
	LCD->LCD_RAM = 0x00;
//	LCD->LCD_RAM = 0x00;
//	LCD->LCD_RAM = 0xEF;
	LCD->LCD_RAM = 0x01;
	LCD->LCD_RAM = 0x8F;
	LCD->LCD_REG = 0x2B; // set page address
	LCD->LCD_RAM = 0x00;
	LCD->LCD_RAM = 0x00;
//	LCD->LCD_RAM = 0x01;
//	LCD->LCD_RAM = 0x8F;
	LCD->LCD_RAM = 0x00;
	LCD->LCD_RAM = 0xEF;
	LCD->LCD_REG = 0x29; //display on
	LCD_SetFont(&LCD_DEFAULT_FONT);
}

void LCD_Blending(void)
{
	LCD->LCD_REG = 0x2C; // write memory start
	DMA_Config();
	DMA_Cmd(DMA2_Stream1, ENABLE);
	while (DMA_GetCmdStatus(DMA2_Stream1) != DISABLE)
	{
	}
	DMA_Cmd(DMA2_Stream3, ENABLE);
	while (DMA_GetCmdStatus(DMA2_Stream3) != DISABLE)
	{
	}
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
	TextColor = _TextColor;
	BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
	*_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
	TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
	BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *fonts)
{
	LCD_Currentfonts = fonts;
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
	return LCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearLine(uint16_t Line)
{
	uint32_t i;
//	uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;

	/* Send the string character by character on lCD */
//	while (((refcolumn + 1) & 0xFFFF) >= LCD_Currentfonts->Width)
//	{
		/* Display one character on LCD */
//		LCD_DisplayChar(Line, refcolumn, ' ');
		/* Decrement the column position by 16 */
//		refcolumn -= LCD_Currentfonts->Width;
//		LCD_Blending();
//	}
//	for (i = Line * LCD_PIXEL_WIDTH * LCD_Currentfonts->Width; i < Line * LCD_PIXEL_WIDTH * LCD_Currentfonts->Width + 400; i++)
	for (i = Line * LCD_PIXEL_WIDTH; i < Line * LCD_PIXEL_WIDTH + 400; i++)
	{
		vram_buffer[i] = BackColor;
	}
	for (i = 1; i < LCD_Currentfonts->Height; i++)
	{
		memcpy(&vram_buffer[Line * LCD_PIXEL_WIDTH + LCD_PIXEL_WIDTH * i], &vram_buffer[Line * LCD_PIXEL_WIDTH], LCD_PIXEL_WIDTH * 2);
	}
	LCD_Blending();
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{
	uint32_t index = 0;

