PJayChen/STM32f4xx_Bootloader/Utilities/stm32f4_evb_lcd.c
	for (index = 0; index < LCD_PIXEL_WIDTH * LCD_PIXEL_HEIGHT; index++)
	{
		vram_buffer[index] = Color;
	}
	LCD_Blending();
}

/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @retval None
  */
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
//	Ypos = LCD_PIXEL_WIDTH - Ypos;
//	LCD_WriteReg(0x02, (Ypos & 0x100) >> 8);
//	LCD_WriteReg(0x03, (Ypos & 0xFF));
//	LCD_WriteReg(0x06, (Xpos & 0x100) >> 8);
//	LCD_WriteReg(0x07, (Xpos & 0xFF));
/*	LCD->LCD_REG = 0x2A;
	LCD->LCD_RAM = Xpos >> 8;
	LCD->LCD_RAM = Xpos & 0xFF;
	LCD->LCD_RAM = (LCD_PIXEL_WIDTH - 1) >> 8;
	LCD->LCD_RAM = (LCD_PIXEL_WIDTH - 1) & 0xFF;
	LCD->LCD_REG = 0x2B;
	LCD->LCD_RAM = Ypos >> 8;
	LCD->LCD_RAM = Ypos & 0xFF;	
	LCD->LCD_RAM = (LCD_PIXEL_HEIGHT - 1) >> 8;
	LCD->LCD_RAM = (LCD_PIXEL_HEIGHT - 1) & 0xFF;*/
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c)
{	
	uint32_t index = 0, i = 0;

	for (index = 0; index < LCD_Currentfonts->Height; index++)
	{
		for (i = 0; i < LCD_Currentfonts->Width; i++)
		{
			if ((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) && (LCD_Currentfonts->Width <= 12)) ||
				(((c[index] & (0x1 << i)) == 0x00) && (LCD_Currentfonts->Width > 12 )))
			{
				vram_buffer[LCD_PIXEL_WIDTH * (Ypos + index) + (Xpos + i )] = BackColor;
			}
			else
			{
				vram_buffer[LCD_PIXEL_WIDTH * (Ypos + index) + (Xpos + i )] = TextColor;
			}
		}
	}
}

/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  */
void LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
	Ascii -= 32;
	LCD_DrawChar(Column, Line, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
}

/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  *ptr: pointer to string to display on LCD.
  * @retval None
  */
void LCD_DisplayStringLine(uint16_t Line, uint8_t *ptr)
{
	uint16_t xpos;

	xpos = 0;
	while (*ptr != 0 & xpos < LCD_PIXEL_WIDTH)
	{
		LCD_DisplayChar(Line, xpos, *ptr);
		xpos += LCD_Currentfonts->Width;
		ptr++;
	}
	LCD_Blending();
}

/**
  * @brief  Sets a display window
  * @param  Xpos: specifies the X bottom left position.
  * @param  Ypos: specifies the Y bottom left position.
  * @param  Height: display window height.
  * @param  Width: display window width.
  * @retval None
  */
void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
	/* Horizontal GRAM Start Address */
	if (Xpos >= Height)
	{
		LCD_WriteReg(LCD_REG_2, (Xpos - Height + 1) >> 8);
		LCD_WriteReg(LCD_REG_3, (Xpos - Height + 1));
	}
	else
	{
		LCD_WriteReg(LCD_REG_2, 0);
		LCD_WriteReg(LCD_REG_3, 0);
	}
	/* Horizontal GRAM End Address */
	LCD_WriteReg(LCD_REG_4, Xpos>>8);
	LCD_WriteReg(LCD_REG_5, Xpos);
	/* Vertical GRAM Start Address */
	if (Ypos >= Width)
	{
		LCD_WriteReg(LCD_REG_6, (Ypos - Width + 1) >> 8);
		LCD_WriteReg(LCD_REG_7, (Ypos - Width + 1));
	}
	else
	{
		LCD_WriteReg(LCD_REG_6, 0);
		LCD_WriteReg(LCD_REG_7, 0);
	}
	/* Vertical GRAM End Address */
	LCD_WriteReg(LCD_REG_8, Ypos >> 8);
	LCD_WriteReg(LCD_REG_9, Ypos);
	LCD_SetCursor(Xpos, Ypos);
}

/**
  * @brief  Disables LCD Window mode.
  * @param  None
  * @retval None
  */
void LCD_WindowModeDisable(void)
{
	LCD_SetDisplayWindow(239, 0x18F, 240, 400);
}

/**
  * @brief  Displays a line.
  * @param Xpos: specifies the X position.
  * @param Ypos: specifies the Y position.
  * @param Length: line length.
  * @param Direction: line direction.
  *   This parameter can be one of the following values: Vertical or Horizontal.
  * @retval None
  */
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
#if 0
	uint32_t i = 0;

	LCD_SetCursor(Xpos, Ypos);
	if (Direction == LCD_DIR_HORIZONTAL)
	{
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		for (i = 0; i < Length; i++)
		{
			LCD_WriteRAM(TextColor);
		}
	}
	else
	{
		for (i = 0; i < Length; i++)
		{
			LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
			LCD_WriteRAM(TextColor);
			Xpos++;
			LCD_SetCursor(Xpos, Ypos);
		}
	}
#endif
}

/**
  * @brief  Displays a rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
	LCD_DrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
	LCD_DrawLine((Xpos + Height), Ypos, Width, LCD_DIR_HORIZONTAL);
	LCD_DrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
	LCD_DrawLine(Xpos, (Ypos - Width + 1), Height, LCD_DIR_VERTICAL);
}

/**
  * @brief  Displays a circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
	int32_t D;/* Decision Variable */
	uint32_t CurX;/* Current X Value */
	uint32_t CurY;/* Current Y Value */

	D = 3 - (Radius << 1);
	CurX = 0;
	CurY = Radius;
	while (CurX <= CurY)
	{
		LCD_SetCursor(Xpos + CurX, Ypos + CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos + CurX, Ypos - CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos - CurX, Ypos + CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos - CurX, Ypos - CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos + CurY, Ypos + CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos + CurY, Ypos - CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos - CurY, Ypos + CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		LCD_SetCursor(Xpos - CurY, Ypos - CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(TextColor);
		if (D < 0)
		{
			D += (CurX << 2) + 6;
		}
		else
		{
			D += ((CurX - CurY) << 2) + 10;
			CurY--;
		}
	CurX++;
	}
}

/**
  * @brief  Displays a mono-color picture.
  * @param  Pict: pointer to the picture array.
  * @retval None
  */
void LCD_DrawMonoPict(const uint32_t *Pict)
{
	uint32_t index = 0, i = 0;

